Repository: dennisfranck/Easy-Watermark
Catalog: languages/easy-watermark-*.po
Languages: pt_br

# "Cache busting" setting description line 1
source: This feature will add version parameter to image file url. This will prevent browser from using cached image.
pt_br: Esta funcionalidade adicionará um parâmetro de versão à URL do arquivo de imagem. Isso impedirá que o navegador use a imagem em cache.

# "Cache busting" setting description line 2
source: Without this option turned on browser might display original image which was cached before instead of the watermarked one.
pt_br: Sem esta opção ativada, o navegador pode exibir a imagem original que estava em cache em vez da imagem com marca d'água.

# "Cache busting" setting description line 3
source: Turn this off only if it causes problems in your environment (e.g. images do not show at all).
pt_br: Desative isso apenas se causar problemas no seu ambiente (ex: imagens não aparecem).

# "Filter srcset" setting description line 1
source: Srcset attribute contains information about other image sizes and lets the browser decide which image to display based on the screen size.
pt_br: O atributo srcset contém informações sobre outros tamanhos de imagem e permite que o navegador decida qual imagem exibir com base no tamanho da tela.

# "Filter srcset" setting description line 2
source: This is good in general but it might cause problems if some watermarks are applied only to certain image sizes.
pt_br: Isso é bom em geral, mas pode causar problemas se algumas marcas d'água forem aplicadas apenas a certos tamanhos de imagem.

# "Filter srcset" setting description line 3
source: With this option enabled srcset attribute will only contain image sizes watermarked the same way.
pt_br: Com esta opção ativada, o atributo srcset conterá apenas tamanhos de imagem com marca d'água da mesma forma.

source: %s error has occured.
pt_br: %s erro ocorreu.

source: %s watermark moved to the Trash.
pt_br: %s marca d'água movida para a lixeira.

source: %s watermark not updated, somebody is editing it.
pt_br: %s marca d'água não atualizada, alguém está editando.

source: %s watermark permanently deleted.
pt_br: %s marca d'água excluída permanentemente.

source: %s watermark restored from the Trash.
pt_br: %s marca d'água restaurada da lixeira.

source: %s watermark updated.
pt_br: %s marca d'água atualizada.

source: 1 watermarkt not updated, somebody is editing it.
pt_br: 1 marca d'água não atualizada, alguém está editando.

# add new on admin bar
source: Watermark
pt_br: Marca d'água

source: Add New Watermark
pt_br: Adicionar Nova Marca d'água

source: Admin email
pt_br: E-mail do administrador

# admin menu
source: Watermarks
pt_br: Marcas d'água

source: admin@example.com
pt_br: admin@exemplo.com

source: Alignment
pt_br: Alinhamento

source: All images uploaded on this page will be watermarked by Auto Watermark feature.
pt_br: Todas as imagens enviadas nesta página receberão marca d'água pela funcionalidade de Marca d'água Automática.

source: All Watermarks
pt_br: Todas as Marcas d'água

source: All watermarks has been applied.
pt_br: Todas as marcas d'água foram aplicadas.

source: Allow for all users
pt_br: Permitir para todos os usuários

source: Allow to apply watermarks
pt_br: Permitir aplicar marcas d'água

source: Allow to create watermarks
pt_br: Permitir criar marcas d'água

source: Allow to edit others watermarks
pt_br: Permitir editar marcas d'água de outros

source: An error occured while processing %1$s: %2$s
pt_br: Ocorreu um erro ao processar %1$s: %2$s

source: Applied
pt_br: Aplicado

source: Applies all available watermarks to this image only.
pt_br: Aplica todas as marcas d'água disponíveis apenas a esta imagem.

source: Apply
pt_br: Aplicar

source: Apply all watermarks
pt_br: Aplicar todas as marcas d'água

source: Apply remaining watermarks
pt_br: Aplicar marcas d'água restantes

source: Applying Rules
pt_br: Regras de Aplicação

source: Attachment direct URL
pt_br: URL direta do anexo

source: Attachment file not found.
pt_br: Arquivo de anexo não encontrado.

source: Attachment height
pt_br: Altura do anexo

source: Attachment ID
pt_br: ID do anexo

source: Attachment MIME type
pt_br: Tipo MIME do anexo

source: Attachment page URL
pt_br: URL da página do anexo

source: Attachment size
pt_br: Tamanho do anexo

source: Attachment title
pt_br: Título do anexo

source: Attachment upload date
pt_br: Data de envio do anexo

source: Attachment width
pt_br: Largura do anexo

source: Author display name
pt_br: Nome de exibição do autor

source: Author email
pt_br: E-mail do autor

source: Author first name
pt_br: Primeiro nome do autor

source: Author ID
pt_br: ID do autor

source: Author last name
pt_br: Sobrenome do autor

source: Author login
pt_br: Login do autor

source: Author nicename
pt_br: Nome amigável do autor

source: Author role
pt_br: Função do autor

source: Author website URL
pt_br: URL do site do autor

source: Auto Watermark
pt_br: Marca d'água Automática

source: Auto Watermark option allows to apply watermark automatically during image upload. Below you can configure this behavior.
pt_br: A opção de Marca d'água Automática permite aplicar marca d'água automaticamente durante o envio da imagem. Abaixo você pode configurar este comportamento.

source: Automatically apply this watermark during image upload
pt_br: Aplicar automaticamente esta marca d'água durante o envio da imagem

source: Backupper
pt_br: Sistema de Backup

source: Blog name
pt_br: Nome do blog

source: Blog URL
pt_br: URL do blog

source: Bulk Watermark
pt_br: Marca d'água em Massa

source: Cancel
pt_br: Cancelar

source: Change preview image
pt_br: Alterar imagem de pré-visualização

source: Check this option to scale watermark only if watermark image is larger than the image being watermarked.
pt_br: Marque esta opção para redimensionar a marca d'água apenas se a imagem da marca d'água for maior que a imagem a ser marcada.

source: Check this to enable Auto Watermark for all users
pt_br: Marque para ativar a Marca d'água Automática para todos os usuários

source: Choose preview image
pt_br: Escolher imagem de pré-visualização

source: Choose Watermark Image
pt_br: Escolher Imagem da Marca d'água

source: Click on image to change it.
pt_br: Clique na imagem para alterá-la.

source: Click on image to show fullsize preview.
pt_br: Clique na imagem para mostrar a pré-visualização em tamanho real.

source: Contain
pt_br: Conter

# Continuation of "Filter srcset" setting label.
source: for watermarked images
pt_br: para imagens com marca d'água

source: Could not copy attachment file to backup directory.
pt_br: Não foi possível copiar o arquivo de anexo para o diretório de backup.

source: Could not create backup directory.
pt_br: Não foi possível criar o diretório de backup.

source: Could not create output image.
pt_br: Não foi possível criar a imagem de saída.

source: Could not create output image. Please check your server configuration.
pt_br: Não foi possível criar a imagem de saída. Por favor, verifique a configuração do servidor.

source: Could not create temporary image. Please check your server configuration.
pt_br: Não foi possível criar imagem temporária. Por favor, verifique a configuração do servidor.

source: Could not remove backup file.
pt_br: Não foi possível remover o arquivo de backup.

source: Could not restore attachment.
pt_br: Não foi possível restaurar o anexo.

source: Cover
pt_br: Cobrir

source: Create watermark
pt_br: Criar marca d'água

source: Current date
pt_br: Data atual

source: Current time
pt_br: Hora atual

source: Custom field deleted.
pt_br: Campo personalizado excluído.

source: Custom field updated.
pt_br: Campo personalizado atualizado.

source: Delete Permanently
pt_br: Excluir Permanentemente

source: Doe
pt_br: Silva

source: Easy Watermark &rsaquo; Error
pt_br: Easy Watermark &rsaquo; Erro

source: Edit
pt_br: Editar

source: Edit Watermark
pt_br: Editar Marca d'água

source: Enable backup
pt_br: Habilitar backup

source: Example:
pt_br: Exemplo:

source: Field must be an instance of EasyWatermark\Settings\Field. %s given
pt_br: O campo deve ser uma instância de EasyWatermark\Settings\Field. %s fornecido

source: Filter srcset
pt_br: Filtrar srcset

source: Fit to height
pt_br: Ajustar à altura

source: Fit to width
pt_br: Ajustar à largura

source: Font
pt_br: Fonte

source: Font "%s" could not be found.
pt_br: Fonte "%s" não encontrada.

source: Forest landscape
pt_br: Paisagem de floresta

source: General
pt_br: Geral

source: Here you can quickly restore backup for all images in Media Library.
pt_br: Aqui você pode restaurar rapidamente o backup de todas as imagens na Biblioteca de Mídia.

source: http://example.com
pt_br: http://exemplo.com

source: http://example.com/forest-landscape
pt_br: http://exemplo.com/paisagem-floresta

source: http://example.com/wp-content/uploads/2018/02/forest-landscape.jpg
pt_br: http://exemplo.com/wp-content/uploads/2018/02/paisagem-floresta.jpg

source: If unchecked, Auto Watermark function will depend on the role settings.
pt_br: Se desmarcado, a função de Marca d'água Automática dependerá das configurações da função.

source: Image
pt_br: Imagem

source: Image sizes
pt_br: Tamanhos de imagem

source: Image types
pt_br: Tipos de imagem

source: Image Watermark
pt_br: Marca d'água de Imagem

source: Invalid request.
pt_br: Requisição inválida.

source: Invalid view name type
pt_br: Tipo de nome de view inválido

source: Johhnie
pt_br: Joaozinho

source: John
pt_br: João

source: John - fast finegrs - Doe
pt_br: João - dedos rápidos - Silva

source: John Doe's Blog
pt_br: Blog do João da Silva

source: john.doe@example.com
pt_br: joao.silva@exemplo.com

source: johndoe
pt_br: joaosilva

source: johndoe.com
pt_br: joaosilva.com

source: Jpeg Quality
pt_br: Qualidade JPEG

# label for attachments which has no backup to restore
source: No backup available
pt_br: Nenhum backup disponível

# label for image used as watermark
source: Used as watermark
pt_br: Usado como marca d'água

# label for unsupported attachment type (other than image)
source: Not supported
pt_br: Não suportado

# link text for media library in grid mode
source: Grid Mode
pt_br: Modo Grade

# link text for new watermark page
source: create watermark
pt_br: criar marca d'água

source: M j, Y @ G:i
pt_br: j \d\e F \d\e Y @ G:i

source: New Watermark
pt_br: Nova Marca d'água

source: No attachment id.
pt_br: Nenhum ID de anexo.

source: No backup available for any of selected items.
pt_br: Nenhum backup disponível para nenhum dos itens selecionados.

source: No items selected
pt_br: Nenhum item selecionado

source: No watermark data to save.
pt_br: Nenhum dado de marca d'água para salvar.

source: No watermark id.
pt_br: Nenhum ID de marca d'água.

source: No watermarks found in Trash.
pt_br: Nenhuma marca d'água encontrada na lixeira.

source: No watermarks found.
pt_br: Nenhuma marca d'água encontrada.

source: None
pt_br: Nenhum

source: None from the selected items qualified for watermarking.
pt_br: Nenhum dos itens selecionados qualificado para marca d'água.

source: Note: if this option is not checked watermark image will also get scaled up on bigger images which might result in loss of quality/redability.
pt_br: Nota: se esta opção não estiver marcada, a imagem da marca d'água também será ampliada em imagens maiores, o que pode resultar em perda de qualidade/legibilidade.

source: Note: The same watermark will never get applied twice to the same image. This tool is safe to use even if some of the images are already watermarked.
pt_br: Nota: A mesma marca d'água nunca será aplicada duas vezes à mesma imagem. Esta ferramenta é segura para uso mesmo se algumas imagens já tiverem marca d'água.

source: Offset
pt_br: Deslocamento

source: Opacity
pt_br: Opacidade

source: Original image has been restored.
pt_br: A imagem original foi restaurada.

source: Params should be an array.
pt_br: Os parâmetros devem ser um array.

source: Parent Watermarks:
pt_br: Marcas d'água ascendentes:

source: Permissions
pt_br: Permissões

source: Permissions saved.
pt_br: Permissões salvas.

# Placeholder for watermark text preview if no text specified.
source: no_text
pt_br: sem_texto

source: Placeholder must be an instance of abstract Placeholder class.
pt_br: Placeholder deve ser uma instância da classe abstrata Placeholder.

# post type general name
source: Watermarks
pt_br: Marcas d'água

# post type singular name
source: Watermark
pt_br: Marca d'água

source: Post types
pt_br: Tipos de post

source: Restore
pt_br: Restaurar

source: Restore Backup
pt_br: Restaurar Backup

source: Restore original image
pt_br: Restaurar imagem original

source: Restore original images
pt_br: Restaurar imagens originais

source: Restored %s images
pt_br: Restauradas %s imagens

source: Saving preview image failed.
pt_br: Falha ao salvar a imagem de pré-visualização.

source: Scale
pt_br: Escala

source: Scale down only
pt_br: Apenas reduzir

source: Scaling mode
pt_br: Modo de escala

source: Search placeholders
pt_br: Pesquisar marcadores

source: Search Watermarks
pt_br: Pesquisar Marcas d'água

source: Section must be an instance of EasyWatermark\Settings\Section. %s given
pt_br: A seção deve ser uma instância de EasyWatermark\Settings\Section. %s fornecido

source: Select preview image
pt_br: Selecionar imagem de pré-visualização

source: Select Watermark
pt_br: Selecionar Marca d'água

source: Select what post type attachments should be automatically watermarked
pt_br: Selecione quais anexos de tipos de post devem receber marca d'água automaticamente

source: Select which image sizes should be watermarked
pt_br: Selecione quais tamanhos de imagem devem receber marca d'água

source: Select which image types should be automatically watermarked
pt_br: Selecione quais tipos de imagem devem receber marca d'água automaticamente

source: Select, which user roles can have a permission to apply watermarks (only roles with permission to upload files are listed here)
pt_br: Selecione quais funções de usuário podem ter permissão para aplicar marcas d'água (apenas funções com permissão para enviar arquivos são listadas aqui)

source: Select/Upload Image
pt_br: Selecionar/Enviar Imagem

source: Set as preview image
pt_br: Definir como imagem de pré-visualização

source: Set as Watermark Image
pt_br: Definir como Imagem da Marca d'água

source: Set jpeg quality from 0 (worst quality, smaller file) to 100 (best quality, biggest file). Set -1 for default quality.
pt_br: Defina a qualidade JPEG de 0 (pior qualidade, arquivo menor) a 100 (melhor qualidade, arquivo maior). Defina -1 para qualidade padrão.

source: Settings
pt_br: Configurações

source: Settings must be an instance of EasyWatermark\Settings\Settings. %s given
pt_br: As configurações devem ser uma instância de EasyWatermark\Settings\Settings. %s fornecido

source: Settings saved.
pt_br: Configurações salvas.

source: Something went wrong while allocating text color.
pt_br: Algo deu errado ao alocar a cor do texto.

source: Something went wrong while applying watermark image.
pt_br: Algo deu errado ao aplicar a imagem da marca d'água.

source: Something went wrong while applying watermark text.
pt_br: Algo deu errado ao aplicar o texto da marca d'água.

source: Something went wrong while processing watermark image.
pt_br: Algo deu errado ao processar a imagem da marca d'água.

source: Something went wrong while saving temporary data.
pt_br: Algo deu errado ao salvar dados temporários.

source: Something went wrong. Please refresh the page and try again.
pt_br: Algo deu errado. Por favor, atualize a página e tente novamente.

source: Something went wrong. Please try again.
pt_br: Algo deu errado. Por favor, tente novamente.

source: Start
pt_br: Iniciar

source: Subscriber
pt_br: Assinante

source: Successfully restored %s images.
pt_br: %s imagens foram restauradas com sucesso.

source: Successfully watermarked %s images.
pt_br: %s imagens receberam marca d'água com sucesso.

source: Text
pt_br: Texto

source: Text angle
pt_br: Ângulo do texto

source: Text color
pt_br: Cor do texto

source: Text preview can be only generated for text watermark.
pt_br: A pré-visualização de texto só pode ser gerada para marca d'água de texto.

source: Text size
pt_br: Tamanho do texto

source: Text Watermark
pt_br: Marca d'água de Texto

source: There are no backed up images in your Media Library.
pt_br: Não há imagens com backup em sua Biblioteca de Mídia.

source: There are no backed up images.
pt_br: Não há imagens com backup.

source: There are no image attachments in your Media Library available for watermarking.
pt_br: Não há anexos de imagem em sua Biblioteca de Mídia disponíveis para marca d'água.

source: There are no images eligible for watermarking.
pt_br: Não há imagens elegíveis para aplicação de marca d'água.

source: There are no watermarks configured.
pt_br: Não há marcas d'água configuradas.

source: There are no watermarks configured. Please %s first.
pt_br: Não há marcas d'água configuradas. Por favor, %s primeiro.

source: There is %s backed up image in your Media Library.
pt_br: Existe %s imagem com backup em sua Biblioteca de Mídia.

source: This image contains watermarks which has been removed:
pt_br: Esta imagem contém marcas d'água que foram removidas:

source: This plugin can automatically add image and text watermark to pictures as they are uploaded to WordPress media library. You can also watermark existing images manually (all at once or an every single image). Watermark image can be a png, gif (alpha channel supported in both cases) or jpg. It's also possibile to set watermark opacity (doesn't apply to png with alpha channel). For text watermark you can select font, set color, size, angle and opacity.
pt_br: Este plugin pode adicionar automaticamente marcas d'água de imagem e texto às fotos à medida que são enviadas para a biblioteca de mídia do WordPress. Você também pode marcar imagens existentes manualmente (todas de uma vez ou em cada imagem individualmente). A imagem da marca d'água pode ser png, gif (canal alfa suportado em ambos os casos) ou jpg. Também é possível definir a opacidade da marca d'água (não se aplica a png com canal alfa). Para marca d'água de texto, você pode selecionar a fonte, definir cor, tamanho, ângulo e opacidade.

source: Tools
pt_br: Ferramentas

source: Unattached Images
pt_br: Imagens Não Anexadas

source: uploaded through the media library page
pt_br: enviadas através da página da biblioteca de mídia

source: Use %s instead, so you can enable/disable Auto Watermark feature.
pt_br: Use %s em vez disso, para que você possa ativar/desativar a funcionalidade de Marca d'água Automática.

source: User display name
pt_br: Nome de exibição do usuário

source: User email
pt_br: E-mail do usuário

source: User first name
pt_br: Primeiro nome do usuário

source: User ID
pt_br: ID do usuário

source: User last name
pt_br: Sobrenome do usuário

source: User login
pt_br: Login do usuário

source: User nicename
pt_br: Nome amigável do usuário

source: User role
pt_br: Função do usuário

source: User website URL
pt_br: URL do site do usuário

source: Using this tool you can quickly apply watermark to all images in the Media Library.
pt_br: Usando esta ferramenta, você pode aplicar rapidamente marcas d'água a todas as imagens na Biblioteca de Mídia.

source: View file does not exist: %s
pt_br: Arquivo de view não existe: %s

source: View name should be a string, %s given.
pt_br: O nome da view deve ser uma string, %s fornecido.

source: View not found
pt_br: View não encontrada

source: View Watermark
pt_br: Ver Marca d'água

source: Watermark
pt_br: Marca d'água

# Watermark
source: Add New
pt_br: Adicionar Nova

source: Watermark "%1$s" couldn't be applied for "%2$s" image size: %3$s
pt_br: A marca d'água "%1$s" não pôde ser aplicada para o tamanho de imagem "%2$s": %3$s

source: Watermark draft updated.
pt_br: Rascunho de marca d'água atualizado.

source: Watermark has been applied.
pt_br: A marca d'água foi aplicada.

source: Watermark has been deleted.
pt_br: A marca d'água foi excluída.

source: Watermark image file does not exist.
pt_br: O arquivo de imagem da marca d'água não existe.

source: Watermark preview
pt_br: Pré-visualização da marca d'água

source: Watermark restored to revision from %s
pt_br: Marca d'água restaurada para a revisão de %s

source: Watermark saved.
pt_br: Marca d'água salva.

source: Watermark scheduled for: <strong>%1$s</strong>.
pt_br: Marca d'água agendada para: <strong>%1$s</strong>.

source: Watermark Selected
pt_br: Aplicar Marca d'água nos Selecionados

source: Watermark should be an instance of EasyWatermark\Watermark\Watermark class.
pt_br: Watermark deve ser uma instância da classe EasyWatermark\Watermark\Watermark.

source: Watermark should be instance of Easywatermark\Watermark\Watermark.
pt_br: Watermark deve ser uma instância de Easywatermark\Watermark\Watermark.

source: Watermark submitted.
pt_br: Marca d'água enviada.

source: Watermark text
pt_br: Texto da marca d'água

source: Watermark text not specified.
pt_br: Texto da marca d'água não especificado.

source: Watermark Type
pt_br: Tipo de Marca d'água

source: Watermark updated.
pt_br: Marca d'água atualizada.

source: Watermarked %s images
pt_br: Aplicada marca d'água em %s imagens

source: Watermarks
pt_br: Marcas d'água

source: Yes
pt_br: Sim

source: You are about to permanently delete "%s". Are you sure?
pt_br: Você está prestes a excluir permanentemente "%s". Tem certeza?

source: You can only configure 2 watermarks. Please edit already existing ones.
pt_br: Você pode configurar apenas 2 marcas d'água. Por favor, edite as já existentes.

source: You can only have 2 active watermarks. Please delete some other watermark to restore this one.
pt_br: Você pode ter apenas 2 marcas d'água ativas. Por favor, exclua alguma outra marca d'água para restaurar esta.

source: You can use placeholders listed in "Placeholders" metabox.
pt_br: Você pode usar marcadores listados na metabox "Marcadores".

source: You don't have permission to apply watermarks.
pt_br: Você não tem permissão para aplicar marcas d'água.

source: You don't have permission to restore backup.
pt_br: Você não tem permissão para restaurar o backup.

source: You try to watermark an item that doesn't exist. Please refresh the page and try again.
pt_br: Você tentou aplicar marca d'água em um item que não existe. Por favor, atualize a página e tente novamente.
